In [1]:
import numpy as np

import pandas as pd

from pandas import Series, DataFrame

In [2]:
dframe1 = DataFrame({'k1': ['X','X','Y','Y','Z'],
                    'k2': ['alpha','beta','alpha','beta','alpha'],
                    'dset1': np.random.randn(5),
                    'dset2':np.random.randn(5)})
dframe1

  k1     k2     dset1     dset2
0  X  alpha -1.810550  0.794812
1  X   beta -0.312680 -0.144433
2  Y  alpha  0.305235  0.118294
3  Y   beta -1.427905 -1.170210
4  Z  alpha  1.304895  1.742246

In [3]:
grp1 = dframe1['dset1'].groupby(dframe1['k1'])
grp1

In [4]:
grp1.mean()

k1
X   -1.061615
Y   -0.561335
Z    1.304895
Name: dset1, dtype: float64

In [5]:
grp1

In [6]:
cities = np.array(['Enugu','Enugu','Kano','Kano','Lagos'])

months = np.array(['Jan','Feb','Jan','Feb','Jan'])

In [7]:
cities

array(['Enugu', 'Enugu', 'Kano', 'Kano', 'Lagos'], dtype='<U5')

In [8]:
months

array(['Jan', 'Feb', 'Jan', 'Feb', 'Jan'], dtype='<U3')

In [9]:
dframe1['dset2'].groupby([cities,months ]).mean()

Enugu  Feb   -0.144433
       Jan    0.794812
Kano   Feb   -1.170210
       Jan    0.118294
Lagos  Jan    1.742246
Name: dset2, dtype: float64

In [10]:
dframe1

  k1     k2     dset1     dset2
0  X  alpha -1.810550  0.794812
1  X   beta -0.312680 -0.144433
2  Y  alpha  0.305235  0.118294
3  Y   beta -1.427905 -1.170210
4  Z  alpha  1.304895  1.742246

In [12]:
dframe1

  k1     k2     dset1     dset2
0  X  alpha -1.810550  0.794812
1  X   beta -0.312680 -0.144433
2  Y  alpha  0.305235  0.118294
3  Y   beta -1.427905 -1.170210
4  Z  alpha  1.304895  1.742246

In [18]:
dframe1.groupby(['k1', 'k2']).mean()

             dset1     dset2
k1 k2
X  alpha -1.810550  0.794812
   beta  -0.312680 -0.144433
Y  alpha  0.305235  0.118294
   beta  -1.427905 -1.170210
Z  alpha  1.304895  1.742246

In [22]:
dframe1.groupby('k1').size() # gets the number of Xs and Ys present

k1
X    2
Y    2
Z    1
dtype: int64

In [29]:
for name,group in dframe1.groupby('k2'):
    print ('This is the %s group' %name)
    print (group)
    print ('\n')

This is the alpha group
  k1     k2     dset1     dset2
0  X  alpha -1.810550  0.794812
2  Y  alpha  0.305235  0.118294
4  Z  alpha  1.304895  1.742246


This is the beta group
  k1    k2     dset1     dset2
1  X  beta -0.312680 -0.144433
3  Y  beta -1.427905 -1.170210

In [33]:
for (k1,k2), group in dframe1.groupby(['k1','k2']) :
     print ('key1 = %s, key2 = %s' %(k1,k2))
     print (group)
     print('\n')

key1 = X, key2 = alpha
  k1     k2    dset1     dset2
0  X  alpha -1.81055  0.794812


key1 = X, key2 = beta
  k1    k2    dset1     dset2
1  X  beta -0.31268 -0.144433


key1 = Y, key2 = alpha
  k1     k2     dset1     dset2
2  Y  alpha  0.305235  0.118294


key1 = Y, key2 = beta
  k1    k2     dset1    dset2
3  Y  beta -1.427905 -1.17021


key1 = Z, key2 = alpha
  k1     k2     dset1     dset2
4  Z  alpha  1.304895  1.742246

In [37]:
grp_dict = dict(list(dframe1.groupby('k2')))
grp_dict

{'alpha':   k1     k2     dset1     dset2
 0  X  alpha -1.810550  0.794812
 2  Y  alpha  0.305235  0.118294
 4  Z  alpha  1.304895  1.742246,
 'beta':   k1    k2     dset1     dset2
 1  X  beta -0.312680 -0.144433
 3  Y  beta -1.427905 -1.170210}

In [35]:
grp_dict['Y']

  k1     k2     dset1     dset2
2  Y  alpha  0.305235  0.118294
3  Y   beta -1.427905 -1.170210

In [38]:
grp_dict = dict(list(dframe1.groupby(dframe1.dtypes, axis =1)))
grp_dict

C:\Users\HP\AppData\Local\Temp\ipykernel_8624\1733985262.py:1: FutureWarning: DataFrame.groupby with axis=1 is deprecated. Do `frame.T.groupby(...)` without axis instead.
  grp_dict = dict(list(dframe1.groupby(dframe1.dtypes, axis =1)))

{dtype('float64'):       dset1     dset2
 0 -1.810550  0.794812
 1 -0.312680 -0.144433
 2  0.305235  0.118294
 3 -1.427905 -1.170210
 4  1.304895  1.742246,
 dtype('O'):   k1     k2
 0  X  alpha
 1  X   beta
 2  Y  alpha
 3  Y   beta
 4  Z  alpha}

In [45]:
dframe1.T.groupby(list(dframe1.dtypes))

In [61]:
dtset = dframe1.groupby(['k1','k2']),['dtset']
dtset.mean()

AttributeError: 'tuple' object has no attribute 'mean'